ETL/DataProcessors/УстановкаОбъектовКПовторнойВыгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>УстановкаОбъектовКПовторнойВыгрузке</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ETL/InformationRegisters/ЗаданияНаПовторнуюВыгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияНаПовторнуюВыгрузку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НеОчищать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БазаДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКВыгрузке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыКВыгрузке</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыБазКВыгрузке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ETL/Catalogs/ОбъектыКВыгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ОбъектыКВыгрузке</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТаблицыSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлФорматаSQL</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлФорматаSQLНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыБазы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипБазы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыБаз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/DataProcessors/УстановкаОбъектовКПовторнойВыгрузке/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьБазыПоОбъекту(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбъектыКВыгрузкеТипыБазы.ТипБазы КАК ТипБазы
	               |ПОМЕСТИТЬ ВтТипы
	               |ИЗ
	               |	Справочник.ОбъектыКВыгрузке.ТипыБазы КАК ОбъектыКВыгрузкеТипыБазы
	               |ГДЕ
	               |	ОбъектыКВыгрузкеТипыБазы.Ссылка = &Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Базы.Ссылка КАК База
	               |ИЗ
	               |	Справочник.Базы КАК Базы
	               |ГДЕ
	               |	Базы.ТипБазы В
	               |			(ВЫБРАТЬ
	               |				ВтТипы.ТипБазы
	               |			ИЗ
	               |				ВтТипы)";
	Запрос.УстановитьПараметр("Объект", Объект);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура УстановитьНаСервере()
	
	Если Объекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Базы.Количество() = 0 Тогда
		ПоВсем = Истина;
	Иначе
		ПоВсем = Ложь;
	КонецЕсли;
		
	Для Каждого Строка Из Объекты Цикл
		СписокБаз = ПолучитьБазыПоОбъекту(Строка.Значение);
		Если СписокБаз.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого СтрокаБаза Из СписокБаз Цикл
			Если НЕ ПоВсем Тогда
				Если Базы.НайтиПоЗначению(СтрокаБаза.База) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Менеджер = РегистрыСведений.ЗаданияНаПовторнуюВыгрузку.СоздатьМенеджерЗаписи();
			Менеджер.БазаДанных = СтрокаБаза.База;
			Менеджер.ОбъектКВыгрузке = Строка.Значение;
			Менеджер.НеОчищать = НеОчищать;
			Менеджер.Записать();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	
	УстановитьНаСервере();
	
КонецПроцедуры
